clear all;
close all;
clc;

% %随a
% [x,a1]=meshgrid(-3:0.01:3,0:0.01:1.35);
% b1=1.8;
% c1=0.6;
% k=0.2;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% mesh(x,a1,y1);
% x=-3:0.04:3;
% a1=0.8;
% b1=1.8;
% c1=0.6;
% k=0.2;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% plot(x,y1)
% a1=0.9;
% b1=1.8;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1.1;
% b1=1.8;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)

% %随a  a1=a b1=b b2=β m=m   a=0.3/0.4/0.5/0.6
clear all;clc;
 [x,a1]=meshgrid(-3.5:0.01:3.5,1:0.01:1.5);
 b1=1;
 b2=0.7;
 m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 mesh(x,a1,y0);
 x=-3.5:0.01:3.5;
 a1=1;
 b1=1;
 b2=0.7;
 m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 plot(x,y0)
 a1=1.1;
 b1=1;
 b2=0.7;
 m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 hold on
 plot(x,y0)
 a1=1.2;
 b1=1;
 b2=0.7;
 m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b1=1;
 b2=0.7;
 m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 hold on
 plot(x,y0)
 xlim([-3,3])
 xlabel('x')
 ylabel('V(x)')

 x=-10:0.01:10;
 a1=0.5;b1=0.1;b2=0.3;m=4;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 plot(x,y0)
 ylim([0 1.5])
%%随b
% [x,b1]=meshgrid(-3:0.01:3,1.55:0.01:3);
% a1=1;
% c1=0.6;
% k=0.2;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% mesh(x,b1,y1);

% x=-3:0.04:3;
% a1=1;
% b1=1.6;
% c1=0.6;
% k=0.2;
% v=sqrt((b1+sqrt(b1.^2-4.*a1.*c1))/(2.*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% plot(x,y1)
% a1=1;
% b1=1.7;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.9;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)

%随β需将b2改为点乘保证矩阵维度一致   β=0.1/0.2/0.3/0.4
[x,b2]=meshgrid(-3.5:0.01:3.5,0:0.01:1);
 a1=1.3;
 b1=1;
 m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2.*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2.*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2.*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 mesh(x,b2,y0);
 x=-3.5:0.01:3.5;
 a1=1.3;
 b1=1;
 m=1.5;
 b2=0.4;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2.*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2.*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2.*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 plot(x,y0)
 a1=1.3;
 b1=1;
 m=1.5;
 b2=0.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2.*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2.*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2.*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b1=1;
 m=1.5;
 b2=0.6;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2.*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2.*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2.*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b1=1;
 m=1.5;
 b2=0.7;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2.*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2.*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2.*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 hold on
 plot(x,y0)
xlim([-3,3])
 xlabel('x')
 ylabel('V(x)')
%%随c
% [x,c1]=meshgrid(-3:0.01:3,0.3:0.01:0.81);
% a1=1;
% b1=1.8;
% k=0.2;
% v=sqrt((b1+sqrt(b1.^2-4.*a1.*c1))./(2.*c1));
% y0=a1./2.*v.^2-b1./4.*v.^4+c1./6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% mesh(x,c1,y1);

% x=-3:0.04:3;
% a1=1;
% b1=1.8;
% c1=0.4;
% k=0.2;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.5;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.7;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)

% 随b   b=0.05/0.1/0.15/0.2    将a1.^2/(4*b1) 改为（4*b1).\a1.^2
% sqrt(a1/b1)改为sqrt(b1.\a1)
[x,b1]=meshgrid(-3.5:0.01:3.5,0.5:0.01:1.5);
 a1=1.3;
 b2=0.7;
 m=1.5;
 y0=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-b2.*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+(b2.*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 mesh(x,b1,y0);
 x=-3.5:0.01:3.5;
 a1=1.3;
 b2=0.7;
 m=1.5;
 b1=0.8;
 y0=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-b2.*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+(b2.*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 plot(x,y0)
 a1=1.3;
 b2=0.7;
 m=1.5;
 b1=0.9;
 y0=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-b2.*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+(b2.*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b2=0.7;
 m=1.5;
 b1=1;
 y0=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-b2.*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+(b2.*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b2=0.7;
 m=1.5;
 b1=1.1;
 y0=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-b2.*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+(b2.*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 hold on
 plot(x,y0)
 xlim([-3,3])
 xlabel('x')
 ylabel('V(x)')
%%随k
% [x,k]=meshgrid(-3:0.01:3,0.1:0.1:2);
% a1=1;
% b1=1.8;
% c1=0.6;
% v=sqrt((b1+sqrt(b1.^2-4.*a1.*c1))./(2.*c1));
% y0=a1./2.*v.^2-b1./4.*v.^4+c1./6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% mesh(x,k,y1);

% x=-2:0.04:2;
% a1=1;
% b1=1.8;
% c1=0.6;
% k=0.5;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.6;
% k=1.0;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.6;
% k=1.5;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)
% a1=1;
% b1=1.8;
% c1=0.6;
% k=2.0;
% v=sqrt((b1+sqrt(b1.^2-4*a1*c1))/(2*c1));
% y0=a1./2.*v.^2-b1/4.*v.^4+c1/6.*v.^6;
% y1=(a1/2.*x.^2-b1/4.*x.^4+c1/6.*x.^6).*(abs(x)<=v)+(k.*(x+v).^2+y0).*(x<-v)+(k.*(x-v).^2+y0).*(x>v);
% hold on
% plot(x,y1)

%随m   m=3/3.5/4/4.5
[x,m]=meshgrid(-10:0.01:10,1:0.01:2);
 a1=1.3;
 b1=1;
 b2=0.7;
 y0=((b1./4).*(x.^4)-(a1/2).*(x.^2)+(a1.^2)/(4*b1)).*(abs(x)<=sqrt(a1./b1))+(b2.*(x-sqrt(a1./b1))).*((sqrt(a1./b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1./b1))).*((-m<=x)&(x<-sqrt(a1./b1)))+(b2.*(x+2*m-sqrt(a1./b1))).*(((-2*m+sqrt(a1./b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1./b1))).*(((2*m-sqrt(a1./b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1./b1))).*(x<(sqrt(a1./b1)-2*m))+(b2.*(x-2*m+sqrt(a1./b1))).*(x>(-sqrt(a1./b1)+2*m));
 mesh(x,m,y0);
 x=-10:0.01:10;
 a1=1.3;
 b1=1;
 b2=0.7;
 m=1.3;
 y0=((b1./4).*(x.^4)-(a1/2).*(x.^2)+(a1.^2)/(4*b1)).*(abs(x)<=sqrt(a1./b1))+(b2.*(x-sqrt(a1./b1))).*((sqrt(a1./b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1./b1))).*((-m<=x)&(x<-sqrt(a1./b1)))+(b2.*(x+2*m-sqrt(a1./b1))).*(((-2*m+sqrt(a1./b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1./b1))).*(((2*m-sqrt(a1./b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1./b1))).*(x<(sqrt(a1./b1)-2*m))+(b2.*(x-2*m+sqrt(a1./b1))).*(x>(-sqrt(a1./b1)+2*m));
 plot(x,y0)
 a1=1.3;
 b1=1;
 b2=0.7;
 m=1.4;
 y0=((b1./4).*(x.^4)-(a1/2).*(x.^2)+(a1.^2)/(4*b1)).*(abs(x)<=sqrt(a1./b1))+(b2.*(x-sqrt(a1./b1))).*((sqrt(a1./b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1./b1))).*((-m<=x)&(x<-sqrt(a1./b1)))+(b2.*(x+2*m-sqrt(a1./b1))).*(((-2*m+sqrt(a1./b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1./b1))).*(((2*m-sqrt(a1./b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1./b1))).*(x<(sqrt(a1./b1)-2*m))+(b2.*(x-2*m+sqrt(a1./b1))).*(x>(-sqrt(a1./b1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b1=1;
 b2=0.7;
 m=1.5;
 y0=((b1./4).*(x.^4)-(a1/2).*(x.^2)+(a1.^2)/(4*b1)).*(abs(x)<=sqrt(a1./b1))+(b2.*(x-sqrt(a1./b1))).*((sqrt(a1./b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1./b1))).*((-m<=x)&(x<-sqrt(a1./b1)))+(b2.*(x+2*m-sqrt(a1./b1))).*(((-2*m+sqrt(a1./b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1./b1))).*(((2*m-sqrt(a1./b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1./b1))).*(x<(sqrt(a1./b1)-2*m))+(b2.*(x-2*m+sqrt(a1./b1))).*(x>(-sqrt(a1./b1)+2*m));
 hold on
 plot(x,y0)
 a1=1.3;
 b1=1;
 b2=0.7;
 m=1.6;
 y0=((b1./4).*(x.^4)-(a1/2).*(x.^2)+(a1.^2)/(4*b1)).*(abs(x)<=sqrt(a1./b1))+(b2.*(x-sqrt(a1./b1))).*((sqrt(a1./b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1./b1))).*((-m<=x)&(x<-sqrt(a1./b1)))+(b2.*(x+2*m-sqrt(a1./b1))).*(((-2*m+sqrt(a1./b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1./b1))).*(((2*m-sqrt(a1./b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1./b1))).*(x<(sqrt(a1./b1)-2*m))+(b2.*(x-2*m+sqrt(a1./b1))).*(x>(-sqrt(a1./b1)+2*m));
 hold on
 plot(x,y0)
 xlim([-3,3])
 xlabel('x')
 ylabel('V(x)')

 %势阱力 稳态点不可导，求不出
 clear all;clc;
 x=-3:0.01:3;
 a1=1.3;b1=1;b2=0.7;m=1.5;
 y1=((b1./4).*(x.^4)-(a1/2).*(x.^2)+(a1.^2)/(4*b1)).*(abs(x)<=sqrt(a1./b1))+(b2.*(x-sqrt(a1./b1))).*((sqrt(a1./b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1./b1))).*((-m<=x)&(x<-sqrt(a1./b1)))+(b2.*(x+2*m-sqrt(a1./b1))).*(((-2*m+sqrt(a1./b1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(a1./b1))).*(((2*m-sqrt(a1./b1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(a1./b1))).*(x<(sqrt(a1./b1)-2*m))+(b2.*(x-2*m+sqrt(a1./b1))).*(x>(-sqrt(a1./b1)+2*m));
 dy=diff(y1)./diff(x);%对y1求导
 plot(x(1:end-1),dy) %为了保持向量大小一致，对x和y的差分进行了处理，因此导数向量长度会比原始向量短1
ylim([-1 1])


 
 %PUQSR:a=1.3/b=1/β=0.7/m=1.5   QSR:a2=0.61/ b2=1.37/c2=1.86比较
 x=-3.5:0.01:3.5;
 a1=1.3;b1=1;b2=0.7;m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m))-0.2982;
 %y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 a2=0.61; b2=1.37;c2=1.86;
 y1=-(1/2)*((a2.^2).*(b2.^2).*(c2.^2).*x.^2)+(1/4)*((a2.^2).*(b2.^2)+(b2.^2).*(c2.^2)+(c2.^2).*(a2.^2)).*x.^4-(1/6)*(a2.^2+b2.^2+c2.^2).*x.^6+(1/8)*x.^8;
 %plot(x,y0,'b',x,y1,'g--')
 plot(x,y0,'b')
 txt='x_{1}';txt1='x_{2}';txt2='x_{3}';txt3='x_{4}';txt4='x_{5}';txt5='x_{6}';txt6='x_{7}';
 text(1.8,-0.35,txt)
 text(1.43,0,txt1)
 text(sqrt(1.3)-0.07,-0.35,txt2)
 text(-0.1,a1.^2/(4*b1)-0.23,txt3)
 text(-(sqrt(1.3)+0.07),-0.35,txt4)
 text(-1.55,0,txt5)
 text(-1.95,-0.35,txt6)
 xlabel('x')
 ylabel('V(x)')
 xlim([-3 3])
 ylim([-0.5 1])
 
 %PUQSR:a=1.3/b=1/β=0.7/m=1.5   QSR:a2=0.61/ b2=1.37/c2=1.86比较
 clear all;clc;
 x=-3.5:0.01:3.5;
 a1=1.3;b1=1;b2=0.7;m=1.5;
 y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m))-0.2982;
 %y0=(b1/4.*x.^4-a1/2.*x.^2+a1.^2/(4*b1)).*(abs(x)<=sqrt(a1/b1))+(b2*(x-sqrt(a1/b1))).*((sqrt(a1/b1)<x)&(x<=m))+(-b2.*(x+sqrt(a1/b1))).*((-m<=x)&(x<-sqrt(a1/b1)))+(b2*(x+2*m-sqrt(a1/b1))).*(((-2*m+sqrt(a1/b1))<=x)&(x<-m))+(-b2*(x-2*m+sqrt(a1/b1))).*(((2*m-sqrt(a1/b1))>=x)&(x>m))+(-b2*(x+2*m-sqrt(a1/b1))).*(x<(sqrt(a1/b1)-2*m))+(b2*(x-2*m+sqrt(a1/b1))).*(x>(-sqrt(a1/b1)+2*m));
 a2=0.61; b2=1.37;c2=1.86;
 y1=-(1/2)*((a2.^2).*(b2.^2).*(c2.^2).*x.^2)+(1/4)*((a2.^2).*(b2.^2)+(b2.^2).*(c2.^2)+(c2.^2).*(a2.^2)).*x.^4-(1/6)*(a2.^2+b2.^2+c2.^2).*x.^6+(1/8)*x.^8;
 plot(x,y0,'b',x,y1,'g--')
 ylim([-0.5 2])
 xlim([-3.5 3.5])

 %经典四稳势函数
 x=0:0.01:10;
 a1=0.61;b1=1.37;c1=2;m1=1.5;
 y=(a1.^2).*(b1.^2).*(c1.^2).*x-((a1.^2).*(b1.^2)+(b1.^2).*(c1.^2)+(c1.^2).*(a1.^2)).*x.^3+(a1.^2+b1.^2+c1.^2).*x.^5-x.^7;
 y1=-(1/2)*((a1.^2).*(b1.^2).*(c1.^2).*x.^2)+(1/4)*((a1.^2).*(b1.^2)+(b1.^2).*(c1.^2)+(c1.^2).*(a1.^2)).*x.^4-(1/6)*(a1.^2+b1.^2+c1.^2).*x.^6+(1/8)*x.^8;
 y2=-(1/64)*((m1.^3).*((m1.^3)-12*(m1.^2)+44*m1-48)).*x+(3/4)*(m1.*(4-m1)).*(x.^5)-(1/16)*((m1.^2).*(3*(m1.^3)-24*m1+44)).*(x.^3)-x.^7;%将abc替换为m的形式
 y3=exp(x/2);
 plot(x,y3)
 ylim([0 5])
 
 %三维随m
clear all;clc;
a1=1.3;b1=1;b2=0.7;
x=-3.5:0.01:3.5;
m=1.3:0.01:2;
for i=1:length(x)

    for j=1:length(m)
       y0(j,i)=((b1/4).*(x(i).^4)-(a1/2).*(x(i).^2)+(4*b1).\(a1.^2)).*(abs(x(i))<=sqrt(b1.\a1))+(b2.*(x(i)-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x(i))&(x(i)<=m(j)))+(-b2.*(x(i)+sqrt(b1.\a1))).*((-m(j)<=x(i))&(x(i)<-sqrt(b1.\a1)))+(b2.*(x(i)+2*m(j)-sqrt(b1.\a1))).*(((-2*m(j)+sqrt(b1.\a1))<=x(i))&(x(i)<-m(j)))+(-b2.*(x(i)-2*m(j)+sqrt(b1.\a1))).*(((2*m(j)-sqrt(b1.\a1))>=x(i))&(x(i)>m(j)))+(-b2.*(x(i)+2*m(j)-sqrt(b1.\a1))).*(x(i)<(sqrt(b1.\a1)-2*m(j)))+(b2.*(x(i)-2*m(j)+sqrt(b1.\a1))).*(x(i)>(-sqrt(b1.\a1)+2*m(j)));
    end
end
figure(1)
colormap(winter)
surfc(x,m,y0);%xlim([0 3]);ylim([0.1 0.4])
% ylim([1.2 1.3]);
% zlim([-0.08 0.15]);
 shading interp
xlabel('\it x','FontName','Times New Roman','FontSize',12);
ylabel('\it m','FontName','Times New Roman','FontSize',12);
zlabel('\it V(x)','FontName','Times New Roman','FontSize',12);


%三维随β
clear all;clc;
a1=1.3;b1=1;m=1.5;
x=-3.5:0.02:3.5;
b2=0.4:0.005:1;
for i=1:length(x)

    for j=1:length(b2)
       y0(j,i)=((b1/4).*(x(i).^4)-(a1/2).*(x(i).^2)+(4*b1).\(a1.^2)).*(abs(x(i))<=sqrt(b1.\a1))+(b2(j).*(x(i)-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x(i))&(x(i)<=m))+(-b2(j).*(x(i)+sqrt(b1.\a1))).*((-m<=x(i))&(x(i)<-sqrt(b1.\a1)))+(b2(j).*(x(i)+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x(i))&(x(i)<-m))+(-b2(j).*(x(i)-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x(i))&(x(i)>m))+(-b2(j).*(x(i)+2*m-sqrt(b1.\a1))).*(x(i)<(sqrt(b1.\a1)-2*m))+(b2(j).*(x(i)-2*m+sqrt(b1.\a1))).*(x(i)>(-sqrt(b1.\a1)+2*m));
    end
end
figure(1)
colormap(winter)
surfc(x,b2,y0);%xlim([0 3]);ylim([0.1 0.4])
% ylim([1.2 1.3]);
% zlim([-0.08 0.15]);
 shading interp
xlabel('\it x','FontName','Times New Roman','FontSize',12);
ylabel('\it\beta','FontName','Times New Roman','FontSize',12);
zlabel('\it V(x)','FontName','Times New Roman','FontSize',12);

%三维随a
clear all;clc;
b1=1;b2=0.7;m=1.5;
x=-3.5:0.01:3.5;
a1=1:0.005:1.7;
for i=1:length(x)

    for j=1:length(a1)
       y0(j,i)=((b1/4).*(x(i).^4)-(a1(j)/2).*(x(i).^2)+(4*b1).\(a1(j).^2)).*(abs(x(i))<=sqrt(b1.\a1(j)))+(b2.*(x(i)-sqrt(b1.\a1(j)))).*((sqrt(b1.\a1(j))<x(i))&(x(i)<=m))+(-b2.*(x(i)+sqrt(b1.\a1(j)))).*((-m<=x(i))&(x(i)<-sqrt(b1.\a1(j))))+(b2.*(x(i)+2*m-sqrt(b1.\a1(j)))).*(((-2*m+sqrt(b1.\a1(j)))<=x(i))&(x(i)<-m))+(-b2.*(x(i)-2*m+sqrt(b1.\a1(j)))).*(((2*m-sqrt(b1.\a1(j)))>=x(i))&(x(i)>m))+(-b2.*(x(i)+2*m-sqrt(b1.\a1(j)))).*(x(i)<(sqrt(b1.\a1(j))-2*m))+(b2.*(x(i)-2*m+sqrt(b1.\a1(j)))).*(x(i)>(-sqrt(b1.\a1(j))+2*m));
    end
end
figure(1)
colormap(winter)
surfc(x,a1,y0);%xlim([0 3]);ylim([0.1 0.4])
% ylim([1.2 1.3]);
% zlim([-0.08 0.15]);
 shading interp
xlabel('\it x','FontName','Times New Roman','FontSize',12);
ylabel('\ita','FontName','Times New Roman','FontSize',12);
zlabel('\it V(x)','FontName','Times New Roman','FontSize',12);

%三维随b
clear all;clc;
a1=1.3;b2=0.7;m=1.5;
x=-3.5:0.002:3.5;
b1=0.8:0.005:1.3;
for i=1:length(x)

    for j=1:length(b1)
       y0(j,i)=((b1(j)/4).*(x(i).^4)-(a1/2).*(x(i).^2)+(4*b1(j)).\(a1.^2)).*(abs(x(i))<=sqrt(b1(j).\a1))+(b2.*(x(i)-sqrt(b1(j).\a1))).*((sqrt(b1(j).\a1)<x(i))&(x(i)<=m))+(-b2.*(x(i)+sqrt(b1(j).\a1))).*((-m<=x(i))&(x(i)<-sqrt(b1(j).\a1)))+(b2.*(x(i)+2*m-sqrt(b1(j).\a1))).*(((-2*m+sqrt(b1(j).\a1))<=x(i))&(x(i)<-m))+(-b2.*(x(i)-2*m+sqrt(b1(j).\a1))).*(((2*m-sqrt(b1(j).\a1))>=x(i))&(x(i)>m))+(-b2.*(x(i)+2*m-sqrt(b1(j).\a1))).*(x(i)<(sqrt(b1(j).\a1)-2*m))+(b2.*(x(i)-2*m+sqrt(b1(j).\a1))).*(x(i)>(-sqrt(b1(j).\a1)+2*m));
    end
end
figure(1)
colormap(winter)
surfc(x,b1,y0);%xlim([0 3]);ylim([0.1 0.4])
% ylim([1.2 1.3]);
% zlim([-0.08 0.15]);
 shading interp
xlabel('\it x','FontName','Times New Roman','FontSize',12);
ylabel('\itb','FontName','Times New Roman','FontSize',12);
zlabel('\it V(x)','FontName','Times New Roman','FontSize',12);

%三维mfpt
clear all; clc;
[D,m]=meshgrid(0.1:0.01:0.5,1.8:0.001:2.3);%T35,T53随m
b2=0.7;a1=1.3;b1=1;
t13=((b2.^2).\D).*(exp(D.\(b2.*(m-sqrt(b1.\a1))))+exp(D.\(b2.*(-m+sqrt(b1.\a1))))-2);
t35=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
t57=(b2.\sqrt(b1.\a1)).*(-1+exp(D.\(b2.*(m-sqrt(b1.\a1))))).*exp(-(4*b1.*D).\(a1.^2));
mesh(D,m,t13)
shading interp
xlabel('\it D','FontName','Times New Roman','FontSize',12);
ylabel('\itm','FontName','Times New Roman','FontSize',12);
zlabel('\it T_{35}&T_{53}','FontName','Times New Roman','FontSize',12);


ylim([1.8,2.2])
%zlim([0,100])

t=0:0.1:2*pi;
plot(t,sin(t),'g');
xlim([0,2*pi]);
xlabel('x')
ylabel('y')
axes('position',[0.55,0.55,0.3,0.3]);%关键在这句！所画的小图
plot(t,sin(t));
xlabel('t')
ylabel('y')
xlim([0,1*pi]);%

%二维T57,T31随β变化
clear all;close all;clc;
[D,m]=meshgrid(0.1:0.001:1,1.5:0.001:2.5);
b1=1;a1=1.3;b2=0.7;
t13=((b2.^2).\D).*(exp(D.\(b2.*(m-sqrt(b1.\a1))))+exp(D.\(b2.*(-m+sqrt(b1.\a1))))-2);
t35=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
t57=(b2.\sqrt(b1.\a1)).*(-1+exp(D.\(b2.*(m-sqrt(b1.\a1))))).*exp(-(4*b1.*D).\(a1.^2));
mesh(D,m,t13)
mesh(D,m,t35)
mesh(D,m,t57)
D=0:0.01:1;
a1=1.3;b1=1;b2=0.7;m=1.8;
t13=((b2.^2).\D).*(exp(D.\(b2.*(m-sqrt(b1.\a1))))+exp(D.\(b2.*(-m+sqrt(b1.\a1))))-2);
t351=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
t57=(b2.\sqrt(b1.\a1)).*(-1+exp(D.\(b2.*(m-sqrt(b1.\a1))))).*exp(-(4*b1.*D).\(a1.^2));
plot(D,t13,'r',D,t351,'r-.',D,t57,'r-*','LineWidth',1.5)
a1=1.3;b1=1;b2=0.7;m=1.9;
t13=((b2.^2).\D).*(exp(D.\(b2.*(m-sqrt(b1.\a1))))+exp(D.\(b2.*(-m+sqrt(b1.\a1))))-2);
t352=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
t57=(b2.\sqrt(b1.\a1)).*(-1+exp(D.\(b2.*(m-sqrt(b1.\a1))))).*exp(-(4*b1.*D).\(a1.^2));
hold on
plot(D,t13,'b',D,t352,'b-.',D,t57,'b-*','LineWidth',1.5)
a1=1.3;b1=1;b2=0.7;m=2;
t13=((b2.^2).\D).*(exp(D.\(b2.*(m-sqrt(b1.\a1))))+exp(D.\(b2.*(-m+sqrt(b1.\a1))))-2);
t353=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
t57=(b2.\sqrt(b1.\a1)).*(-1+exp(D.\(b2.*(m-sqrt(b1.\a1))))).*exp(-(4*b1.*D).\(a1.^2));
hold on
plot(D,t13,'g',D,t353,'g-.',D,t57,'g-*','LineWidth',1.5)
a1=1.3;b1=1;b2=0.7;m=2.1;
t13=((b2.^2).\D).*(exp(D.\(b2.*(m-sqrt(b1.\a1))))+exp(D.\(b2.*(-m+sqrt(b1.\a1))))-2);
t354=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
t57=(b2.\sqrt(b1.\a1)).*(-1+exp(D.\(b2.*(m-sqrt(b1.\a1))))).*exp(-(4*b1.*D).\(a1.^2));
hold on
plot(D,t13,'m',D,t354,'m-.',D,t57,'m-*','LineWidth',1.5)
xlim([0 0.5])
ylim([0 40])

%t=0:0.1:2*pi;
%plot(t,sin(t),'g');

axes('position',[0.55,0.55,0.3,0.3]); %关键在这句！所画的小图
plot(D,t351,'r-.',D,t352,'b-.',D,t353,'g-.',D,t354,'m-.','LineWidth',1.5);
xlim([0 0.5])
ylim([0 40])
%xlabel('t')
%ylabel('y')
%xlim([0,1*pi]);%

%二维T35,T53随m变化 
clear all;close all;clc;
[D,m]=meshgrid(0.1:0.01:100,1:0.01:2.5);
a1=1.3;b1=1;b2=0.7;
t35=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
mesh(D,m,t35)
D=0:0.01:300;
% a1=1.3;b1=1;b2=0.7;m=1.2;
% t35=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
% plot(D,t35)
% a1=1.3;b1=1;b2=0.7;m=1.5;
% t35=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
% hold on
% plot(D,t35)
% a1=1.3;b1=1;b2=0.7;m=1.8;
% t35=(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
% hold on
% plot(D,t35)
a1=1.3;b1=1;b2=0.7;m=4.9;
t35=500*(b2.\sqrt(b1.\a1)).*(1-exp(D.\(b2.*(-m+sqrt(b1.\a1))))).*exp((4*b1.*D).\(a1.^2));
hold on
plot(D,t35)
ylim([0 100])


%二维ρst随D a=1.3 b=1 β=0.7 m=1.5
clear all;clc;
 x=-5:0.01:5;
 a1=1.3;b1=1;b2=0.7;m=1.5;A=0.05;
 u=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-b2.*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+(b2.*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 pa=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+(b2.*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/0.1);
 n=quad(pa,-12,12);
 p1=(1/n)*exp(-u/0.1);
 pb=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+(b2.*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/0.15);
 n=quad(pb,-12,12);
 p2=(1/n)*exp(-u/0.15);
 pc=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+(b2.*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/0.2);
 n=quad(pc,-12,12);
 p3=(1/n)*exp(-u/0.2);
 pd=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+(b2.*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/0.25);
 n=quad(pd,-12,12);
 p4=(1/n)*exp(-u/0.25);
 plot(x,p1,x,p2,x,p3,x,p4)
 xlim([-5 5])
 ylim([0 0.7])
 
 
 %二维ρst随a  b=0.2 β=0.3 m=4 D=0.1
clear all;clc;
 x=-5:0.01:5;
 b1=1;b2=0.7;m=1.5;D=0.1;
 u1=((b1/4).*(x.^4)-((1.1)/2).*(x.^2)+(4*b1).\((1.1).^2)).*(abs(x)<=sqrt(b1.\(1.1)))+(b2.*(x-sqrt(b1.\(1.1)))).*((sqrt(b1.\(1.1))<x)&(x<=m))+(-b2.*(x+sqrt(b1.\(1.1)))).*((-m<=x)&(x<-sqrt(b1.\(1.1))))+(b2.*(x+2*m-sqrt(b1.\(1.1)))).*(((-2*m+sqrt(b1.\(1.1)))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\(1.1)))).*(((2*m-sqrt(b1.\(1.1)))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\(1.1)))).*(x<(sqrt(b1.\(1.1))-2*m))+(b2.*(x-2*m+sqrt(b1.\(1.1)))).*(x>(-sqrt(b1.\(1.1))+2*m));
 pa=@(x1) exp(-(((b1/4).*(x1.^4)-((1.1)/2).*(x1.^2)+(4*b1).\((1.1).^2)).*(abs(x1)<=sqrt(b1.\(1.1)))+(b2.*(x1-sqrt(b1.\(1.1)))).*((sqrt(b1.\(1.1))<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\(1.1)))).*((-m<=x1)&(x1<-sqrt(b1.\(1.1))))+(b2.*(x1+2*m-sqrt(b1.\(1.1)))).*(((-2*m+sqrt(b1.\(1.1)))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\(1.1)))).*(((2*m-sqrt(b1.\(1.1)))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\(1.1)))).*(x1<(sqrt(b1.\(1.1))-2*m))+(b2.*(x1-2*m+sqrt(b1.\(1.1)))).*(x1>(-sqrt(b1.\(1.1))+2*m)))/D);
 n=quad(pa,-5,5);
 p1=(1/n)*exp(-u1/D);
 u2=((b1/4).*(x.^4)-((1.2)/2).*(x.^2)+(4*b1).\((1.2).^2)).*(abs(x)<=sqrt(b1.\(1.2)))+(b2.*(x-sqrt(b1.\(1.2)))).*((sqrt(b1.\(1.2))<x)&(x<=m))+(-b2.*(x+sqrt(b1.\(1.2)))).*((-m<=x)&(x<-sqrt(b1.\(1.2))))+(b2.*(x+2*m-sqrt(b1.\(1.2)))).*(((-2*m+sqrt(b1.\(1.2)))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\(1.2)))).*(((2*m-sqrt(b1.\(1.2)))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\(1.2)))).*(x<(sqrt(b1.\(1.2))-2*m))+(b2.*(x-2*m+sqrt(b1.\(1.2)))).*(x>(-sqrt(b1.\(1.2))+2*m));
 pb=@(x1) exp(-(((b1/4).*(x1.^4)-((1.2)/2).*(x1.^2)+(4*b1).\((1.2).^2)).*(abs(x1)<=sqrt(b1.\(1.2)))+(b2.*(x1-sqrt(b1.\(1.2)))).*((sqrt(b1.\(1.2))<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\(1.2)))).*((-m<=x1)&(x1<-sqrt(b1.\(1.2))))+(b2.*(x1+2*m-sqrt(b1.\(1.2)))).*(((-2*m+sqrt(b1.\(1.2)))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\(1.2)))).*(((2*m-sqrt(b1.\(1.2)))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\(1.2)))).*(x1<(sqrt(b1.\(1.2))-2*m))+(b2.*(x1-2*m+sqrt(b1.\(1.2)))).*(x1>(-sqrt(b1.\(1.2))+2*m)))/D);
 n=quad(pb,-5,5);
 p2=(1/n)*exp(-u2/D);
 u3=((b1/4).*(x.^4)-((1.3)/2).*(x.^2)+(4*b1).\((1.3).^2)).*(abs(x)<=sqrt(b1.\(1.3)))+(b2.*(x-sqrt(b1.\(1.3)))).*((sqrt(b1.\(1.3))<x)&(x<=m))+(-b2.*(x+sqrt(b1.\(1.3)))).*((-m<=x)&(x<-sqrt(b1.\(1.3))))+(b2.*(x+2*m-sqrt(b1.\(1.3)))).*(((-2*m+sqrt(b1.\(1.3)))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\(1.3)))).*(((2*m-sqrt(b1.\(1.3)))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\(1.3)))).*(x<(sqrt(b1.\(1.3))-2*m))+(b2.*(x-2*m+sqrt(b1.\(1.3)))).*(x>(-sqrt(b1.\(1.3))+2*m));
 pc=@(x1) exp(-(((b1/4).*(x1.^4)-((1.3)/2).*(x1.^2)+(4*b1).\((1.3).^2)).*(abs(x1)<=sqrt(b1.\(1.3)))+(b2.*(x1-sqrt(b1.\(1.3)))).*((sqrt(b1.\(1.3))<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\(1.3)))).*((-m<=x1)&(x1<-sqrt(b1.\(1.3))))+(b2.*(x1+2*m-sqrt(b1.\(1.3)))).*(((-2*m+sqrt(b1.\(1.3)))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\(1.3)))).*(((2*m-sqrt(b1.\(1.3)))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\(1.3)))).*(x1<(sqrt(b1.\(1.3))-2*m))+(b2.*(x1-2*m+sqrt(b1.\(1.3)))).*(x1>(-sqrt(b1.\(1.3))+2*m)))/D);
 n=quad(pc,-5,5);
 p3=(1/n)*exp(-u3/D);
 u4=((b1/4).*(x.^4)-((1.4)/2).*(x.^2)+(4*b1).\((1.4).^2)).*(abs(x)<=sqrt(b1.\(1.4)))+(b2.*(x-sqrt(b1.\(1.4)))).*((sqrt(b1.\(1.4))<x)&(x<=m))+(-b2.*(x+sqrt(b1.\(1.4)))).*((-m<=x)&(x<-sqrt(b1.\(1.4))))+(b2.*(x+2*m-sqrt(b1.\(1.4)))).*(((-2*m+sqrt(b1.\(1.4)))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt(b1.\(1.4)))).*(((2*m-sqrt(b1.\(1.4)))>=x)&(x>m))+(-b2.*(x+2*m-sqrt(b1.\(1.4)))).*(x<(sqrt(b1.\(1.4))-2*m))+(b2.*(x-2*m+sqrt(b1.\(1.4)))).*(x>(-sqrt(b1.\(1.4))+2*m));
 pd=@(x1) exp(-(((b1/4).*(x1.^4)-((1.4)/2).*(x1.^2)+(4*b1).\((1.4).^2)).*(abs(x1)<=sqrt(b1.\(1.4)))+(b2.*(x1-sqrt(b1.\(1.4)))).*((sqrt(b1.\(1.4))<x1)&(x1<=m))+(-b2.*(x1+sqrt(b1.\(1.4)))).*((-m<=x1)&(x1<-sqrt(b1.\(1.4))))+(b2.*(x1+2*m-sqrt(b1.\(1.4)))).*(((-2*m+sqrt(b1.\(1.4)))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt(b1.\(1.4)))).*(((2*m-sqrt(b1.\(1.4)))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt(b1.\(1.4)))).*(x1<(sqrt(b1.\(1.4))-2*m))+(b2.*(x1-2*m+sqrt(b1.\(1.4)))).*(x1>(-sqrt(b1.\(1.4))+2*m)))/D);
 n=quad(pd,-5,5);
 p4=(1/n)*exp(-u4/D);
 plot(x,p1,x,p2,x,p3,x,p4)
 xlim([-3 3])
 ylim([0 0.75])
 
 %二维ρst随b a=0.4 β=0.3 m=4 D=0.1
 clear all;clc;
 x=-5:0.01:5;
 a1=1.3;b2=0.7;m=1.5;D=0.1;
 u1=(((0.8)/4).*(x.^4)-(a1/2).*(x.^2)+(4*(0.8)).\(a1.^2)).*(abs(x)<=sqrt((0.8).\a1))+(b2.*(x-sqrt((0.8).\a1))).*((sqrt((0.8).\a1)<x)&(x<=m))+(-b2.*(x+sqrt((0.8).\a1))).*((-m<=x)&(x<-sqrt((0.8).\a1)))+(b2.*(x+2*m-sqrt((0.8).\a1))).*(((-2*m+sqrt((0.8).\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt((0.8).\a1))).*(((2*m-sqrt((0.8).\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt((0.8).\a1))).*(x<(sqrt((0.8).\a1)-2*m))+(b2.*(x-2*m+sqrt((0.8).\a1))).*(x>(-sqrt((0.8).\a1)+2*m));
 pa=@(x1) exp(-((((0.8)/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*(0.8)).\(a1.^2)).*(abs(x1)<=sqrt((0.8).\a1))+(b2.*(x1-sqrt((0.8).\a1))).*((sqrt((0.8).\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt((0.8).\a1))).*((-m<=x1)&(x1<-sqrt((0.8).\a1)))+(b2.*(x1+2*m-sqrt((0.8).\a1))).*(((-2*m+sqrt((0.8).\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt((0.8).\a1))).*(((2*m-sqrt((0.8).\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt((0.8).\a1))).*(x1<(sqrt((0.8).\a1)-2*m))+(b2.*(x1-2*m+sqrt((0.8).\a1))).*(x1>(-sqrt((0.8).\a1)+2*m)))/D);
 n=quad(pa,-12,12);
 p1=(1/n)*exp(-u1/D);
 u2=(((0.9)/4).*(x.^4)-(a1/2).*(x.^2)+(4*(0.9)).\(a1.^2)).*(abs(x)<=sqrt((0.9).\a1))+(b2.*(x-sqrt((0.9).\a1))).*((sqrt((0.9).\a1)<x)&(x<=m))+(-b2.*(x+sqrt((0.9).\a1))).*((-m<=x)&(x<-sqrt((0.9).\a1)))+(b2.*(x+2*m-sqrt((0.9).\a1))).*(((-2*m+sqrt((0.9).\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt((0.9).\a1))).*(((2*m-sqrt((0.9).\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt((0.9).\a1))).*(x<(sqrt((0.9).\a1)-2*m))+(b2.*(x-2*m+sqrt((0.9).\a1))).*(x>(-sqrt((0.9).\a1)+2*m));
 pb=@(x1) exp(-((((0.9)/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*(0.9)).\(a1.^2)).*(abs(x1)<=sqrt((0.9).\a1))+(b2.*(x1-sqrt((0.9).\a1))).*((sqrt((0.9).\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt((0.9).\a1))).*((-m<=x1)&(x1<-sqrt((0.9).\a1)))+(b2.*(x1+2*m-sqrt((0.9).\a1))).*(((-2*m+sqrt((0.9).\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt((0.9).\a1))).*(((2*m-sqrt((0.9).\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt((0.9).\a1))).*(x1<(sqrt((0.9).\a1)-2*m))+(b2.*(x1-2*m+sqrt((0.9).\a1))).*(x1>(-sqrt((0.9).\a1)+2*m)))/D);
 n=quad(pb,-12,12);
 p2=(1/n)*exp(-u2/D);
 u3=(((1)/4).*(x.^4)-(a1/2).*(x.^2)+(4*(1)).\(a1.^2)).*(abs(x)<=sqrt((1).\a1))+(b2.*(x-sqrt((1).\a1))).*((sqrt((1).\a1)<x)&(x<=m))+(-b2.*(x+sqrt((1).\a1))).*((-m<=x)&(x<-sqrt((1).\a1)))+(b2.*(x+2*m-sqrt((1).\a1))).*(((-2*m+sqrt((1).\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt((1).\a1))).*(((2*m-sqrt((1).\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt((1).\a1))).*(x<(sqrt((1).\a1)-2*m))+(b2.*(x-2*m+sqrt((1).\a1))).*(x>(-sqrt((1).\a1)+2*m));
 pc=@(x1) exp(-((((1)/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*(1)).\(a1.^2)).*(abs(x1)<=sqrt((1).\a1))+(b2.*(x1-sqrt((1).\a1))).*((sqrt((1).\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt((1).\a1))).*((-m<=x1)&(x1<-sqrt((1).\a1)))+(b2.*(x1+2*m-sqrt((1).\a1))).*(((-2*m+sqrt((1).\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt((1).\a1))).*(((2*m-sqrt((1).\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt((1).\a1))).*(x1<(sqrt((1).\a1)-2*m))+(b2.*(x1-2*m+sqrt((1).\a1))).*(x1>(-sqrt((1).\a1)+2*m)))/D);
 n=quad(pc,-12,12);
 p3=(1/n)*exp(-u3/D);
 u4=(((1.1)/4).*(x.^4)-(a1/2).*(x.^2)+(4*(1.1)).\(a1.^2)).*(abs(x)<=sqrt((1.1).\a1))+(b2.*(x-sqrt((1.1).\a1))).*((sqrt((1.1).\a1)<x)&(x<=m))+(-b2.*(x+sqrt((1.1).\a1))).*((-m<=x)&(x<-sqrt((1.1).\a1)))+(b2.*(x+2*m-sqrt((1.1).\a1))).*(((-2*m+sqrt((1.1).\a1))<=x)&(x<-m))+(-b2.*(x-2*m+sqrt((1.1).\a1))).*(((2*m-sqrt((1.1).\a1))>=x)&(x>m))+(-b2.*(x+2*m-sqrt((1.1).\a1))).*(x<(sqrt((1.1).\a1)-2*m))+(b2.*(x-2*m+sqrt((1.1).\a1))).*(x>(-sqrt((1.1).\a1)+2*m));
 pd=@(x1) exp(-((((1.1)/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*(1.1)).\(a1.^2)).*(abs(x1)<=sqrt((1.1).\a1))+(b2.*(x1-sqrt((1.1).\a1))).*((sqrt((1.1).\a1)<x1)&(x1<=m))+(-b2.*(x1+sqrt((1.1).\a1))).*((-m<=x1)&(x1<-sqrt((1.1).\a1)))+(b2.*(x1+2*m-sqrt((1.1).\a1))).*(((-2*m+sqrt((1.1).\a1))<=x1)&(x1<-m))+(-b2.*(x1-2*m+sqrt((1.1).\a1))).*(((2*m-sqrt((1.1).\a1))>=x1)&(x1>m))+(-b2.*(x1+2*m-sqrt((1.1).\a1))).*(x1<(sqrt((1.1).\a1)-2*m))+(b2.*(x1-2*m+sqrt((1.1).\a1))).*(x1>(-sqrt((1.1).\a1)+2*m)))/D);
 n=quad(pd,-12,12);
 p4=(1/n)*exp(-u4/D);
 plot(x,p1,x,p2,x,p3,x,p4)
 xlim([-3 3])
 ylim([0 0.75])
 
 %二维ρst随β a=0.4 b=0.2 m=4 D=0.1
 clear all;clc;
 x=-5:0.01:5;
 a1=1.3;b1=1;m=1.5;D=0.1;
 u1=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+((0.5).*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-(0.5).*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+((0.5).*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-(0.5).*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-(0.5).*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+((0.5).*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 pa=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+((0.5).*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-(0.5).*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+((0.5).*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-(0.5).*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-(0.5).*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+((0.5).*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/D);
 n=quad(pa,-12,12);
 p1=(1/n)*exp(-u1/D);
 u2=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+((0.6).*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-(0.6).*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+((0.6).*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-(0.6).*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-(0.6).*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+((0.6).*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 pb=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+((0.6).*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-(0.6).*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+((0.6).*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-(0.6).*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-(0.6).*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+((0.6).*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/D);
 n=quad(pb,-12,12);
 p2=(1/n)*exp(-u2/D);
 u3=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+((0.7).*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-(0.7).*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+((0.7).*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-(0.7).*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-(0.7).*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+((0.7).*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 pc=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+((0.7).*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-(0.7).*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+((0.7).*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-(0.7).*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-(0.7).*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+((0.7).*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/D);
 n=quad(pc,-12,12);
 p3=(1/n)*exp(-u3/D);
 u4=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+((0.8).*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=m))+(-(0.8).*(x+sqrt(b1.\a1))).*((-m<=x)&(x<-sqrt(b1.\a1)))+((0.8).*(x+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x)&(x<-m))+(-(0.8).*(x-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x)&(x>m))+(-(0.8).*(x+2*m-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*m))+((0.8).*(x-2*m+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*m));
 pd=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+((0.8).*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=m))+(-(0.8).*(x1+sqrt(b1.\a1))).*((-m<=x1)&(x1<-sqrt(b1.\a1)))+((0.8).*(x1+2*m-sqrt(b1.\a1))).*(((-2*m+sqrt(b1.\a1))<=x1)&(x1<-m))+(-(0.8).*(x1-2*m+sqrt(b1.\a1))).*(((2*m-sqrt(b1.\a1))>=x1)&(x1>m))+(-(0.8).*(x1+2*m-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*m))+((0.8).*(x1-2*m+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*m)))/D);
 n=quad(pd,-12,12);
 p4=(1/n)*exp(-u4/D);
 plot(x,p1,x,p2,x,p3,x,p4)
 xlim([-3 3])
 ylim([0 0.75])
 
 %二维ρst随m a=0.4 b=0.2 β=0.3 D=0.1
 clear all;clc;
 x=-5:0.01:5;
 a1=1.3;b1=1;b2=0.7;D=0.1;
 u1=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=1.3))+(-b2.*(x+sqrt(b1.\a1))).*((-1.3<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*1.3-sqrt(b1.\a1))).*(((-2*1.3+sqrt(b1.\a1))<=x)&(x<-1.3))+(-b2.*(x-2*1.3+sqrt(b1.\a1))).*(((2*1.3-sqrt(b1.\a1))>=x)&(x>1.3))+(-b2.*(x+2*1.3-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*1.3))+(b2.*(x-2*1.3+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*1.3));
 pa=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=1.3))+(-b2.*(x1+sqrt(b1.\a1))).*((-1.3<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*1.3-sqrt(b1.\a1))).*(((-2*1.3+sqrt(b1.\a1))<=x1)&(x1<-1.3))+(-b2.*(x1-2*1.3+sqrt(b1.\a1))).*(((2*1.3-sqrt(b1.\a1))>=x1)&(x1>1.3))+(-b2.*(x1+2*1.3-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*1.3))+(b2.*(x1-2*1.3+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*1.3)))/D);
 n=quad(pa,-12,12);
 p1=(1/n)*exp(-u1/D);
 u2=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=1.4))+(-b2.*(x+sqrt(b1.\a1))).*((-1.4<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*1.4-sqrt(b1.\a1))).*(((-2*1.4+sqrt(b1.\a1))<=x)&(x<-1.4))+(-b2.*(x-2*1.4+sqrt(b1.\a1))).*(((2*1.4-sqrt(b1.\a1))>=x)&(x>1.4))+(-b2.*(x+2*1.4-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*1.4))+(b2.*(x-2*1.4+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*1.4));
 pb=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=1.4))+(-b2.*(x1+sqrt(b1.\a1))).*((-1.4<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*1.4-sqrt(b1.\a1))).*(((-2*1.4+sqrt(b1.\a1))<=x1)&(x1<-1.4))+(-b2.*(x1-2*1.4+sqrt(b1.\a1))).*(((2*1.4-sqrt(b1.\a1))>=x1)&(x1>1.4))+(-b2.*(x1+2*1.4-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*1.4))+(b2.*(x1-2*1.4+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*1.4)))/D);
 n=quad(pb,-12,12);
 p2=(1/n)*exp(-u2/D);
 u3=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=1.5))+(-b2.*(x+sqrt(b1.\a1))).*((-1.5<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*1.5-sqrt(b1.\a1))).*(((-2*1.5+sqrt(b1.\a1))<=x)&(x<-1.5))+(-b2.*(x-2*1.5+sqrt(b1.\a1))).*(((2*1.5-sqrt(b1.\a1))>=x)&(x>1.5))+(-b2.*(x+2*1.5-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*1.5))+(b2.*(x-2*1.5+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*1.5));
 pc=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=1.5))+(-b2.*(x1+sqrt(b1.\a1))).*((-1.5<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*1.5-sqrt(b1.\a1))).*(((-2*1.5+sqrt(b1.\a1))<=x1)&(x1<-1.5))+(-b2.*(x1-2*1.5+sqrt(b1.\a1))).*(((2*1.5-sqrt(b1.\a1))>=x1)&(x1>1.5))+(-b2.*(x1+2*1.5-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*1.5))+(b2.*(x1-2*1.5+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*1.5)))/D);
 n=quad(pc,-12,12);
 p3=(1/n)*exp(-u3/D);
 u4=((b1/4).*(x.^4)-(a1/2).*(x.^2)+(4*b1).\(a1.^2)).*(abs(x)<=sqrt(b1.\a1))+(b2.*(x-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x)&(x<=1.6))+(-b2.*(x+sqrt(b1.\a1))).*((-1.6<=x)&(x<-sqrt(b1.\a1)))+(b2.*(x+2*1.6-sqrt(b1.\a1))).*(((-2*1.6+sqrt(b1.\a1))<=x)&(x<-1.6))+(-b2.*(x-2*1.6+sqrt(b1.\a1))).*(((2*1.6-sqrt(b1.\a1))>=x)&(x>1.6))+(-b2.*(x+2*1.6-sqrt(b1.\a1))).*(x<(sqrt(b1.\a1)-2*1.6))+(b2.*(x-2*1.6+sqrt(b1.\a1))).*(x>(-sqrt(b1.\a1)+2*1.6));
 pd=@(x1) exp(-(((b1/4).*(x1.^4)-(a1/2).*(x1.^2)+(4*b1).\(a1.^2)).*(abs(x1)<=sqrt(b1.\a1))+(b2.*(x1-sqrt(b1.\a1))).*((sqrt(b1.\a1)<x1)&(x1<=1.6))+(-b2.*(x1+sqrt(b1.\a1))).*((-1.6<=x1)&(x1<-sqrt(b1.\a1)))+(b2.*(x1+2*1.6-sqrt(b1.\a1))).*(((-2*1.6+sqrt(b1.\a1))<=x1)&(x1<-1.6))+(-b2.*(x1-2*1.6+sqrt(b1.\a1))).*(((2*1.6-sqrt(b1.\a1))>=x1)&(x1>1.6))+(-b2.*(x1+2*1.6-sqrt(b1.\a1))).*(x1<(sqrt(b1.\a1)-2*1.6))+(b2.*(x1-2*1.6+sqrt(b1.\a1))).*(x1>(-sqrt(b1.\a1)+2*1.6)))/D);
 n=quad(pd,-12,12);
 p4=(1/n)*exp(-u4/D);
 plot(x,p1,x,p2,x,p3,x,p4)
 xlim([-3 3])
 ylim([0 0.8])